tap "adoptopenjdk/openjdk"
tap "azure/functions"
tap "blacktop/tap"
tap "cloudfoundry/tap"
tap "finestructure/tap"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "teamookla/speedtest"
tap "yschimke/tap"
# Search tool like grep, but optimized for programmers
brew "ack"
# Apache ActiveMQ: powerful open source messaging server
brew "activemq"
# Java build tool
brew "ant"
# Tool for reverse engineering 3rd party, closed, binary Android apps
brew "apktool"
# Multi-protocol messaging broker based on ActiveMQ
brew "apollo"
# Graphical system information display for macOS
brew "archey"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Record and share terminal sessions
brew "asciinema"
# Automatic configure script builder
brew "autoconf"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Control blink(1) indicator light
brew "blink1"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Extract files from Microsoft cabinet files
brew "cabextract"
# Core application library for C
brew "glib"
# Control Google Chrome from the command-line
brew "chrome-cli"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Generate code for scanning Z-polyhedra
brew "cloog"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Asynchronous event library
brew "libev"
# International domain name library
brew "libidn"
# Control the macOS dark mode from the command-line
brew "dark-mode"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Common error values for all GnuPG components
brew "libgpg-error"
# Assuan IPC Library
brew "libassuan"
# X.509 and CMS library
brew "libksba"
# GNU Portable THreads
brew "pth"
# Server for managing certificate revocation lists
brew "dirmngr"
# Programming language for highly scalable real-time systems
brew "erlang"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# ISO AAC audio encoder
brew "faac"
# OpenType text shaping engine
brew "harfbuzz"
# High quality MPEG Audio Layer III (MP3) encoder
brew "lame"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GNU compiler collection
brew "gcc"
# CLI program that accepts piped input and presents files for selection
brew "fpp"
# Manage your Google Compute Engine resources
brew "gcutil"
# Graphics library to dynamically manipulate images
brew "gd"
# This library is for the GeoIP Legacy format (dat)
brew "geoip"
# GitHub command-line tool
brew "gh"
# Command-line utility for uploading Gists
brew "gist"
# Command-line utility for creating Gists
brew "gistit"
# GNU multiple precision arithmetic library
brew "gmp@4"
# Framework for layout and rendering of i18n text
brew "pango"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Multimedia framework for research and academic purposes
brew "gpac"
# Multi-threaded malloc() and performance analysis tools
brew "gperftools"
# GPG key agent
brew "gpg-agent"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Colorize logfiles and command output
brew "grc"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Improved top (interactive process viewer)
brew "htop"
# Website copier/offline browser
brew "httrack"
# Add GitHub support to git on the command-line
brew "hub"
# Improved colored diff
brew "icdiff"
# IRC and ICB client
brew "ircii"
# Integer Set Library for the polyhedral model
brew "isl@0.12"
# Extract Digicam setting info from EXIF JPEG headers
brew "jhead"
# Json incremental digger
brew "jid"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Transform nested JSON data into tabular data in the shell
brew "json-table"
# Access DVDs as block devices without the decryption
brew "libdvdcss"
# Library to render SVG files using Cairo
brew "librsvg"
# Library for USB device access
brew "libusb"
# Use Realtek DVB-T dongles as a cheap SDR
brew "librtlsdr"
# Library for USB device access
brew "libusb-compat"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv"
# VisualOn AAC encoder library
brew "libvo-aacenc"
# Lynx-like WWW browser that supports tables, menus, etc.
brew "links"
# Package manager for the Lua programming language
brew "luarocks"
# Security and system auditing tool to harden systems
brew "lynis"
# Text-based web browser
brew "lynx"
# Swiss Army Knife for macOS
brew "m-cli"
# Creates dependencies in makefiles
brew "makedepend"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Remote terminal application
brew "mosh"
# Message broker implementing the MQTT protocol
brew "mosquitto"
# Cross-platform library for audio I/O
brew "portaudio"
# MP3 player for Linux and UNIX
brew "mpg123"
# Parses Message Sequence Chart descriptions and produces images
brew "mscgen"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Open source relational database management system
brew "mysql"
# 💊 steroids for Xcode Playgrounds
brew "nef"
# Fast, highly customisable system info script
brew "neofetch"
# Utility for managing network connections
brew "netcat"
# Statically typed compiled systems programming language
brew "nim"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Renders an animated, color, ANSI-text loop of the Poptart Cat
brew "nyancat"
# General purpose programming language in the ML family
brew "ocaml"
# OCaml package manager
brew "opam"
# Granddaddy of HTML tools, with support for modern standards
brew "tidy-html5"
# General-purpose scripting language
brew "php"
# Programmer-oriented testing framework for PHP
brew "phpunit"
# Optimizer for PNG files
brew "pngcrush"
# Software environment for statistical computing
brew "r"
# Messaging broker
brew "rabbitmq"
# Ruby version manager
brew "rbenv"
# Auto-installs gems for Ruby installs
brew "rbenv-default-gems"
# Persistent key-value database, with built-in net interface
brew "redis"
# Shell to work with Spring HATEOAS-compliant REST resources
brew "rest-shell"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Build tool for Scala projects
brew "sbt"
# JVM-based programming language
brew "scala"
# Library for loading images as SDL surfaces and textures
brew "sdl2_image"
# SOcket CAT: netcat on steroids
brew "socat"
brew "springboot"
# This tool is a command-line client for the SSL Labs APIs
brew "ssllabs-scan"
# Generate clients, server stubs, and docs from an OpenAPI spec
brew "swagger-codegen"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# User interface to the TELNET protocol
brew "telnet"
# Tool which checks for the support of TLS/SSL ciphers and flaws
brew "testssl"
# Convert TeXinfo files to HTML
brew "texi2html"
# Official documentation format of the GNU project
brew "texinfo"
# Framework for scalable cross-language services development
brew "thrift", link: false
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Twitter fork of memcached
brew "twemcache"
# Source code beautifier
brew "uncrustify"
# Extract, view, and test RAR archives
brew "unrar"
# Extraction utility for .zip compressed archives
brew "unzip"
# Syntax-aware linter for prose
brew "vale"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Create screenshots of webpages from the terminal
brew "webkit2png"
# Command-line client for WebSockets
brew "websocat"
# Internet file retriever
brew "wget"
# Small, fast, portable MQTT client C implementation
brew "wolfmqtt"
# Translate common Internet acronyms
brew "wtf"
# Personal information dashboard for your terminal
brew "wtfutil"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Tracks most-used directories to make cd smarter
brew "z"
# General-purpose lossless data-compression library
brew "zlib"
# Tips, tricks, and examples for zsh
brew "zsh-lovers"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Azure Functions Core Tools 2.0
brew "azure/functions/azure-functions-core-tools"
# Download and parse ipsw(s)
brew "blacktop/tap/ipsw"
brew "cloudfoundry/tap/cf-cli"
# Describe your project
brew "finestructure/tap/arena"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# OkUrl
brew "yschimke/tap/okurl"
cask "adoptopenjdk"
cask "aerial"
cask "amethyst"
cask "avibrazil-rdm"
cask "blink1control"
cask "colorpicker-antetype"
cask "corelocationcli"
cask "docker-toolbox"
cask "eclipse-ide"
cask "epubquicklook"
cask "fing"
cask "font-twitter-color-emoji"
cask "gas-mask"
cask "gephi"
cask "gisto"
cask "gqrx"
cask "handbrake"
cask "haskell-platform"
cask "inkscape"
cask "insomnia"
cask "ipynb-quicklook"
cask "launchrocket"
cask "macdown"
cask "manopen"
cask "monitorcontrol"
cask "ngrok"
cask "now"
cask "osxfuse"
cask "platypus"
cask "powershell"
cask "qlmarkdown"
cask "qlplayground"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicknfo"
cask "rstudio"
cask "sequel-pro"
cask "silverlight"
cask "skyfonts"
cask "steam"
cask "suspicious-package"
cask "swiftpm-catalog"
cask "switchhosts"
cask "tcl"
cask "today-scripts"
cask "vagrant"
cask "webpquicklook"
mas "24 Hour Wallpaper", id: 1226087575
mas "Affinity Photo", id: 824183456
mas "Analog", id: 418343177
mas "Apple Configurator 2", id: 1037126344
mas "Aurora", id: 1495998489
mas "baratmo", id: 610049951
mas "BatterySqueezer", id: 439474862
mas "BeFunky Express", id: 1042457604
mas "Boop", id: 1518425043
mas "Caffeine", id: 411246225
mas "Calendar 366 II", id: 1265895169
mas "Camouflage", id: 445264274
mas "com.theitspecialistsllc.restfulmenu", id: 1403153623
mas "Controller 4 Netatmo Presense", id: 1469831167
mas "Controllers Lite", id: 673660806
mas "coucou", id: 620436774
mas "Dash", id: 449589707
mas "DevCleaner", id: 1388020431
mas "Developer", id: 640199958
mas "Dialogue", id: 668273079
mas "Disk Doctor", id: 455970963
mas "Display Menu", id: 549083868
mas "Drafts", id: 1435957248
mas "Ecosia - The search engine that plants trees", id: 1463400445
mas "Evernote", id: 406056744
mas "Fantastical", id: 975937182
mas "Gapplin", id: 768053424
mas "GarageBand", id: 682658836
mas "GIPHY CAPTURE", id: 668208984
mas "GoodNotes", id: 1444383602
mas "Growl", id: 467939042
mas "HardwareGrowler", id: 475260933
mas "Helium", id: 1054607607
mas "HeliumLift", id: 1018899653
mas "HomeAtmo", id: 1359795390
mas "HTTP Client", id: 418138339
mas "Hue-topia", id: 734418119
mas "iA Writer", id: 775737590
mas "iBoostUp", id: 484829041
mas "ibVPN OneClick", id: 1178552493
mas "iFlicks 3", id: 1274494218
mas "iMovie", id: 408981434
mas "iNet Network Scanner", id: 403304796
mas "Integrity Pro", id: 1361976004
mas "Intensify", id: 716854513
mas "JSON Helper", id: 453114608
mas "Kaomoji", id: 1025701729
mas "Kindle", id: 405399194
mas "LightBlue", id: 639944780
mas "Location Helper", id: 488536386
mas "Markoff", id: 1084713122
mas "Melo", id: 483104510
mas "Microsoft Excel", id: 462058435
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "Monosnap", id: 540348655
mas "Moom", id: 419330170
mas "Motion", id: 434290957
mas "MQTT Explorer", id: 1455214828
mas "Netmo", id: 1192219511
mas "NetSpot", id: 514951692
mas "Noizio Lite", id: 1481029536
mas "OneDrive", id: 823766827
mas "Parcel", id: 639968404
mas "Paste JSON as Code • quicktype", id: 1330801220
mas "Pixelmator Pro", id: 1289583905
mas "Playgrounds", id: 1496833156
mas "Rested", id: 421879749
mas "Scratch 3", id: 1446785996
mas "Scribe", id: 789738094
mas "Service Station", id: 1503136033
mas "Slack", id: 803453959
mas "Speedtest", id: 1153157709
mas "Spout", id: 438001695
mas "Textual IRC Client", id: 896450579
mas "The Unarchiver", id: 425424353
mas "Tonality", id: 892581529
mas "Trello", id: 1278508951
mas "TripIt", id: 1475712010
mas "Tumblr", id: 929285034
mas "Tweetbot", id: 557168941
mas "TweetDeck", id: 485812721
mas "Twitter", id: 1482454543
mas "Twitter Scripter", id: 645249778
mas "VisualJSON", id: 488709442
mas "Weather Glance", id: 1483742127
mas "Webcam Settings", id: 533696630
mas "WiFi Scanner", id: 411680127
mas "Witch", id: 412485838
mas "XChat Azure", id: 447521961
mas "Xcode", id: 497799835
